<?php
//Задание 1
echo "<h3>Задание 1</h3>";
$i = 0;
while ($i <= 100) {
    if (($i % 3) == 0) {
        echo "$i ";
    }
    $i++;
}

//Задание 2
echo "<h3>Задание 2</h3>";
$i = 0;

function chet($i){
    if ($i == 0) {
        return "$i - это ноль<br>";
    }
    if ($i % 2) {
        return "$i - нечетное число<br>";
    } else {
        return "$i - четное число<br>";
    }
}

do {
    echo chet($i);
} while (++$i <= 10);

//Задание 3
echo "<h3>Задание 3</h3>";

$arr = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Рязань", "Касимов", "Скопин", "Сасово", "Ряжск"],
    "Ростовская область" => ["Ростов-на-Дону", "Таганрог", "Шахты", "Волгодонск"]
];

foreach ($arr as $area => $cities){
    echo "$area:<br>";
    foreach ($cities as $key => $city){
        ($key < count($cities) - 1) ? $str = "$city, " : $str = "$city<br>";
        echo $str;
    }
}

//Задание 4
echo "<h3>Задание 4</h3>";
$arr = ["а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "yo", "ж" => "zh", "з" => "z", "и" => "i", "й" => "y", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "h", "ц" => "c", "ч" => "ch", "ш" => "sh", "щ" => "sch", "ь" => "'", "ы" => "y", "ъ" => "", "э" => "e", "ю" => "yu", "я" => "ya", "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E", "Ё" => "E", "Ж" => "Zh",  "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K", "Л" => "L", "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R", "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "H", "Ц" => "C", "Ч" => "Ch",  "Ш" => "Sh",  "Щ" => "Sch", "Ь" => "",  "Ы" => "Y", "Ъ" => "", "Э" => "E", "Ю" => "Yu",  "Я" => "Ya"];
$str = "Строка для тестирования номер 1.";
echo $str."<br>";
echo strtr($str, $arr);

//Задание 5
echo "<h3>Задание 5</h3>";
$str = "Строка для тестирования номер 2.";

function replace($str){
    $newStr = str_replace(" ", "_", $str);
    return $newStr;
}

echo replace($str);

//Задание 6
echo "<h3>Задание 6</h3>";
$menu = [
    "Главная",
    "Запчасти" => ["Двигатели", "Системы зажигания", "Томозные системы", "Фильтры"],
    "Шины" => ["Yokohama", "Triangle", "Nokian", "TOYO"],
    "Контакты"
];
$ul = "<ul>";
foreach ($menu as $key => $items){
    if (gettype($items) == "array") {
        $ul .= "<li><a href='#'>$key</a><ul>";
        foreach ($items as $item){
            $ul .= "<li><a href='#'>$item</a></li>";
        }
        $ul .= "</ul></li>";
    }
    else $ul .= "<li><a href='#'>$items</a></li>";
}
$ul .= "</ul>";
echo $ul;

//Задание 7
echo "<h3>Задание 7</h3>";

for ($i = 0; $i <= 9; print $i++." "){

}

//Задание 8
echo "<h3>Задание 8</h3>";
$arr = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Рязань", "Касимов", "Скопин", "Сасово", "Ряжск"],
    "Ростовская область" => ["Ростов-на-Дону", "Таганрог", "Шахты", "Волгодонск"]
];

foreach ($arr as $area => $cities){
    foreach ($cities as $key => $city){
        if (mb_substr($city, 0, 1) == 'К'){
            echo "$city\n";
        }
    }
}

//Задание 9
echo "<h3>Задание 9</h3>";
$str = "Строка для тестирования номер 3.";
echo $str."<br>";

function transform($string){
    $array = ["а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "yo", "ж" => "zh", "з" => "z", "и" => "i", "й" => "y", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "h", "ц" => "c", "ч" => "ch", "ш" => "sh", "щ" => "sch", "ь" => "'", "ы" => "y", "ъ" => "", "э" => "e", "ю" => "yu", "я" => "ya", "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E", "Ё" => "E", "Ж" => "Zh",  "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K", "Л" => "L", "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R", "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "H", "Ц" => "C", "Ч" => "Ch",  "Ш" => "Sh",  "Щ" => "Sch", "Ь" => "",  "Ы" => "Y", "Ъ" => "", "Э" => "E", "Ю" => "Yu",  "Я" => "Ya", " " => "_"];
    // $newStr = strtr($str, $arr);
    return strtr($string, $array);
}

echo transform($str);
?>